---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Dispose
source: html/ac49907d-059e-da05-be6b-1ac0d2d76c02.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.Dispose Method

Releases all resources used by the MEPNetworkIterator

## Syntax (C#)
```csharp
public void Dispose()
```